test/socket_stress_testing/join.yml
# my-scenario.yml
config:
  target: "http://localhost:3000/"
  phases:
    - duration: 60
      arrivalRate: 10
  engines:
    socketio-v3: {}

scenarios:
  - name: "Join the game room"
    engine: socketio-v3
    flow:
      - emit:
          channel: "join"
          data:
            userId: "{{ $.userId }}"
            userName: "{{ $.userName }}"
            roomId: "95071250"
          response:
            channel: "userJoined"
      - log: "Captured values: {{ $.userId }}, {{ $.userName }}"
      - think: 30

    processor:
      - random:
          scope: "Join the game room"
          name: "userId"
          functionName: "generateRandomUserId"
      - random:
          scope: "Join the game room"
          name: "userName"
          functionName: "generateRandomUserName"
functions:
  - name: "generateRandomUserId"
    code: |
      function generateRandomUserId() {
        const length = 8;
        const characters = '1234567890';
        let result = '';
        for (let i = 0; i < length; i++) {
          result += characters.charAt(Math.floor(Math.random() * characters.length));
        }
        return result;
      }
  - name: "generateRandomUserName"
    code: |
      function generateRandomUserName() {
        const length = 5;
        const characters = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789';
        let result = '';
        for (let i = 0; i < length; i++) {
          result += characters.charAt(Math.floor(Math.random() * characters.length));
        }
        return result;
      }